---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartWeight
source: html/6f06082d-18d6-9b77-f952-9af8fdf43c41.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartWeight Property

"Weight"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartWeight { get; }
```